## Plan Result (sbox-global)




<pre><code>Plan: 0 to add, 4 to change, 0 to destroy.</code></pre>

* Update
  * module.landing_zone.azurerm_frontdoor.main
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;idam-user-dashboard&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;idam-web-public&#34;]
  * module.landing_zone.azurerm_monitor_diagnostic_setting.frontdoor_diagnostics




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.landing_zone.data.azurerm_monitor_diagnostic_categories.diagnostic_categories will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id          = (known after apply)
      + logs        = (known after apply)
      + metrics     = (known after apply)
      + resource_id = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox"

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor.main will be updated in-place
  ~ resource "azurerm_frontdoor" "main" {
        id                                           = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox"
        name                                         = "hmcts-sbox"
      ~ tags                                         = {
          ~ "environment"  = "Sandbox" -> "sandbox"
            # (4 unchanged elements hidden)
        }
        # (14 unchanged attributes hidden)

      - backend_pool {
          - health_probe_name   = "healthProbeSettings-1668531807589" -> null
          - id                  = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/backendPools/platops-poc" -> null
          - load_balancing_name = "loadBalancingSettings-1668531807589" -> null
          - name                = "platops-poc" -> null

          - backend {
              - address     = "firewall-sbox-palo-flexnet.uksouth.cloudapp.azure.com" -> null
              - enabled     = true -> null
              - host_header = "firewall-sbox-palo-flexnet.uksouth.cloudapp.azure.com" -> null
              - http_port   = 80 -> null
              - https_port  = 443 -> null
              - priority    = 1 -> null
              - weight      = 50 -> null
            }
        }

      - backend_pool_health_probe {
          - enabled             = true -> null
          - id                  = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/healthProbeSettings/healthProbeSettings-1668531807589" -> null
          - interval_in_seconds = 30 -> null
          - name                = "healthProbeSettings-1668531807589" -> null
          - path                = "/" -> null
          - probe_method        = "GET" -> null
          - protocol            = "Http" -> null
        }

      - backend_pool_load_balancing {
          - additional_latency_milliseconds = 0 -> null
          - id                              = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/loadBalancingSettings/loadBalancingSettings-1668531807589" -> null
          - name                            = "loadBalancingSettings-1668531807589" -> null
          - sample_size                     = 4 -> null
          - successful_samples_required     = 2 -> null
        }

      - frontend_endpoint {
          - host_name                               = "platops-poc.sandbox.platform.hmcts.net" -> null
          - id                                      = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/frontendEndpoints/platops-poc-sandbox-platform-hmcts-net" -> null
          - name                                    = "platops-poc-sandbox-platform-hmcts-net" -> null
          - session_affinity_enabled                = false -> null
          - session_affinity_ttl_seconds            = 0 -> null
          - web_application_firewall_policy_link_id = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/plumsbox" -> null
        }

      - routing_rule {
          - accepted_protocols = [
              - "Https",
            ] -> null
          - enabled            = true -> null
          - frontend_endpoints = [
              - "platops-poc-sandbox-platform-hmcts-net",
            ] -> null
          - id                 = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/routingRules/platops-poc" -> null
          - name               = "platops-poc" -> null
          - patterns_to_match  = [
              - "/*",
            ] -> null

          - forwarding_configuration {
              - backend_pool_name                     = "platops-poc" -> null
              - cache_enabled                         = true -> null
              - cache_query_parameter_strip_directive = "StripNone" -> null
              - cache_use_dynamic_compression         = false -> null
              - forwarding_protocol                   = "HttpOnly" -> null
            }
        }

        # (60 unchanged blocks hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["idam-user-dashboard"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/idamuserdashboardsbox"
        name                              = "idamuserdashboardsbox"
      ~ tags                              = {
          ~ "environment"  = "Sandbox" -> "sandbox"
            # (4 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["idam-web-public"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/idamwebpublicsbox"
        name                              = "idamwebpublicsbox"
      ~ tags                              = {
          ~ "environment"  = "Sandbox" -> "sandbox"
            # (4 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_monitor_diagnostic_setting.frontdoor_diagnostics will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "frontdoor_diagnostics" {
        id                         = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox|fd-log-analytics"
        name                       = "fd-log-analytics"
        # (2 unchanged attributes hidden)

      - log {
          - category = "FrontdoorAccessLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      - log {
          - category = "FrontdoorWebApplicationFirewallLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + log {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }
    }

Plan: 0 to add, 4 to change, 0 to destroy.
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["plum"] has changed
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
      ~ frontend_endpoint_ids             = [
          + "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourcegroups/lz-sbox-rg/providers/Microsoft.Network/frontdoors/hmcts-sbox/frontendendpoints/platops-poc-sandbox-platform-hmcts-net",
            "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourcegroups/lz-sbox-rg/providers/Microsoft.Network/frontdoors/hmcts-sbox/frontendendpoints/plum",
        ]
        id                                = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/plumsbox"
        name                              = "plumsbox"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "Low"
            "environment"  = "sandbox"
        }
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":1351,"Program":"tfcmt","SHA1":"","Target":"sbox-global","Vars":{}} -->